In [1]:
import pandas as pd

In [24]:
data = pd.read_csv("Train/Train.csv")

In [25]:
data.head(n=5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,NaN,Q,16,NaN,NaN

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
pclass       1009 non-null float64
survived     1009 non-null float64
name         1009 non-null object
sex          1009 non-null object
age          812 non-null float64
sibsp        1009 non-null float64
parch        1009 non-null float64
ticket       1009 non-null object
fare         1008 non-null float64
cabin        229 non-null object
embarked     1008 non-null object
boat         374 non-null object
body         98 non-null float64
home.dest    582 non-null object
dtypes: float64(7), object(7)
memory usage: 110.4+ KB

In [27]:
columns_to_drop = ['boat','name','ticket','cabin','embarked','home.dest','body']
data_clean = data.drop(columns_to_drop,axis=1)

In [28]:
data_clean.head()

   pclass  survived     sex   age  sibsp  parch    fare
0     3.0       0.0  female   NaN    0.0    0.0   7.750
1     2.0       0.0    male  39.0    0.0    0.0  26.000
2     2.0       1.0  female  40.0    0.0    0.0  13.000
3     3.0       1.0  female  31.0    1.0    1.0  20.525
4     3.0       1.0  female   NaN    2.0    0.0  23.250

In [29]:
from sklearn.preprocessing import LabelEncoder

In [30]:
le = LabelEncoder()
data_clean["sex"]=le.fit_transform(data_clean["sex"])

In [31]:
data_clean.head()

   pclass  survived  sex   age  sibsp  parch    fare
0     3.0       0.0    0   NaN    0.0    0.0   7.750
1     2.0       0.0    1  39.0    0.0    0.0  26.000
2     2.0       1.0    0  40.0    0.0    0.0  13.000
3     3.0       1.0    0  31.0    1.0    1.0  20.525
4     3.0       1.0    0   NaN    2.0    0.0  23.250

In [32]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 7 columns):
pclass      1009 non-null float64
survived    1009 non-null float64
sex         1009 non-null int32
age         812 non-null float64
sibsp       1009 non-null float64
parch       1009 non-null float64
fare        1008 non-null float64
dtypes: float64(6), int32(1)
memory usage: 51.3 KB

In [33]:
data_clean.isnull().sum()

pclass        0
survived      0
sex           0
age         197
sibsp         0
parch         0
fare          1
dtype: int64

In [34]:
data_clean.dropna(subset = ["fare"], inplace=True)

In [36]:
avg_age = data_clean["age"].mean()
print(avg_age)

29.801171393341555

In [37]:
data_clean = data_clean.fillna(avg_age)
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1008 entries, 0 to 1008
Data columns (total 7 columns):
pclass      1008 non-null float64
survived    1008 non-null float64
sex         1008 non-null int32
age         1008 non-null float64
sibsp       1008 non-null float64
parch       1008 non-null float64
fare        1008 non-null float64
dtypes: float64(6), int32(1)
memory usage: 59.1 KB

In [38]:
data_clean.describe()

,pclass,survived,sex,age,sibsp,parch,fare
count,1008.000000,1008.000000,1008.000000,1008.000000,1008.000000,1008.000000,1008.000000
mean,2.294643,0.378968,0.641865,29.801171,0.521825,0.394841,33.647412
std,0.835823,0.485371,0.479690,13.012839,1.077678,0.888441,51.452123
min,1.000000,0.000000,0.000000,0.333300,0.000000,0.000000,0.000000
25%,2.000000,0.000000,0.000000,22.000000,0.000000,0.000000,7.895800
50%,3.000000,0.000000,1.000000,29.801171,0.000000,0.000000,14.458300
75%,3.000000,1.000000,1.000000,35.000000,1.000000,0.000000,31.387500
max,3.000000,1.000000,1.000000,80.000000,8.000000,9.000000,512.329200

In [47]:
test_data = pd.read_csv("Test/Test.csv")
test_data = test_data.drop(columns_to_drop,axis=1)
test_data.head()

   pclass     sex   age  sibsp  parch     fare
0     1.0    male  36.0    0.0    0.0  26.3875
1     3.0  female   NaN    8.0    2.0  69.5500
2     1.0    male   NaN    0.0    0.0  50.0000
3     2.0    male  34.0    0.0    0.0  13.0000
4     2.0    male  28.0    0.0    0.0  13.0000

In [48]:
test_clean = test_data.fillna(avg_age)

In [49]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 6 columns):
pclass    300 non-null float64
sex       300 non-null object
age       234 non-null float64
sibsp     300 non-null float64
parch     300 non-null float64
fare      300 non-null float64
dtypes: float64(5), object(1)
memory usage: 14.1+ KB

In [50]:
test_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 6 columns):
pclass    300 non-null float64
sex       300 non-null object
age       300 non-null float64
sibsp     300 non-null float64
parch     300 non-null float64
fare      300 non-null float64
dtypes: float64(5), object(1)
memory usage: 14.1+ KB

In [53]:
test_clean.head()

   pclass     sex        age  sibsp  parch     fare
0     1.0    male  36.000000    0.0    0.0  26.3875
1     3.0  female  29.801171    8.0    2.0  69.5500
2     1.0    male  29.801171    0.0    0.0  50.0000
3     2.0    male  34.000000    0.0    0.0  13.0000
4     2.0    male  28.000000    0.0    0.0  13.0000

In [55]:
test_clean["sex"]=le.fit_transform(test_clean["sex"])

In [39]:
from sklearn.tree import DecisionTreeClassifier

In [40]:
sk_tree = DecisionTreeClassifier(criterion='entropy',max_depth=5)

In [41]:
input_cols = ['pclass',"sex","age","sibsp","parch","fare"]
output_cols = ["survived"]

X = data_clean[input_cols]
Y = data_clean[output_cols]

print(X.shape,Y.shape)
print(type(X))

(1008, 6) (1008, 1)
<class 'pandas.core.frame.DataFrame'>

In [42]:
sk_tree.fit(X,Y)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=5,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [57]:
result = sk_tree.predict(test_clean)

In [59]:
print(result.shape,type(result))

(300,) <class 'numpy.ndarray'>

In [63]:
df = pd.DataFrame(data=result,columns=["survived"])

In [64]:
df.shape

(300, 1)

In [66]:
df.to_csv('titanic_survival.csv',index = True, index_label=["Id"])